Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldElectrodeClassificationEnum Enumeration
 The weld electrode classification.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldElectrodeClassificationEnum
Public Enumeration WeldElectrodeClassificationEnum
Members
Member name | Value | Description
WELD_ELECTRODE_CLASSIFICATION_NONE | 0 |  No electrode classification.
WELD_ELECTRODE_CLASSIFICATION_35 | 1 |  The electrode classification 35.
WELD_ELECTRODE_CLASSIFICATION_42 | 2 |  The electrode classification 42.
WELD_ELECTRODE_CLASSIFICATION_50 | 3 |  The electrode classification 50.
WELD_ELECTRODE_CLASSIFICATION_E60XX | 4 |  The electrode classification E60XX.
WELD_ELECTRODE_CLASSIFICATION_E70XX | 5 |  The electrode classification E70XX.
WELD_ELECTRODE_CLASSIFICATION_E80XX | 6 |  The electrode classification E80XX.
WELD_ELECTRODE_CLASSIFICATION_E90XX | 7 |  The electrode classification E90XX.
See Also
Reference
Tekla.Structures.Model Namespace